OpenFOAM/cyclist/system/solverInfo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

solverInfo1
{
    // Mandatory entries
    type            solverInfo;
    libs            (utilityFunctionObjects);
    fields          (U p);

    // Optional entries
    writeResidualFields no;
}


// ************************************************************************* //
